app/services/use_case/alerts/create.rb

      def call
        alert = Alert.new(
                      reference_id: self.create_params.dig("alert", "reference_id"),
                      delay: self.create_params.dig("alert", "delay"),
                      description: self.create_params.dig("alert", "description"),
                      expiery_at: (Time.now + self.create_params.dig("alert", "delay").seconds),
                      status: Alert::INIT
                    )
        alert.save!
---
INSERT INTO "alerts" ("delay", "reference_id", "description", "expiery_at", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"