app/services/use_case/alerts/list.rb

      def get_alerts
        self.alerts = Alert.where(status: Alert::INIT)
---
SELECT "alerts".* FROM "alerts" WHERE "alerts"."status" = $1  [["status", "INITLIZED"]]