app/services/use_case/alerts/update_status.rb

SELECT  "alerts".* FROM "alerts" WHERE "alerts"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
      def call
        raise "Record not found" if self.alert.blank?

SELECT  "alerts".* FROM "alerts" WHERE "alerts"."reference_id" = $1 LIMIT $2  [["reference_id", "transcription_start_10"], ["LIMIT", 1]]
---
      def get_alert(alert_id:)
        self.alert = Alert.find_by_reference_id(alert_id)

UPDATE "alerts" SET "status" = $1, "updated_at" = $2 WHERE "alerts"."id" = $3  [["status", "COMPLETED"], ["updated_at", "2018-10-25 13:10:25.081202"], ["id", 9]]
---
      def update_status
        self.alert.status = Alert::DONE
        self.alert.save